Identifier: com.github.adtejaa.jamf.CitrixWorkspace
Input:
  CATEGORY: Apps
  NAME: Citrix Workspace
  PKG_CATEGORY: "%CATEGORY%"
  SOFTWARE_TITLE: Workspace
  POLICY_CATEGORY: %CATEGORY%
  POLICY_NAME: '%NAME%'
  POLICY_RUN_COMMAND: ' '
  POLICY_CUSTOM_TRIGGER: 'install-%NAME%'
  POLICY_RUN_RECON: 'false'
  POLICY_SCOPE_ALL_COMPUTERS: 'true'
  POLICY_TEMPLATE: JamfPolicyTemplate_allcomputers.xml
  REMOVE_OLD_PACKAGES: 'true'
  STOPPROCESSINGIF_PREDICATE: download_changed == FALSE
  VENDOR: Citrix
  SELF_SERVICE_AVAILABLE: 'true'
  SELF_SERVICE_CATEGORY: '%CATEGORY%'
  SELF_SERVICE_DESCRIPTION: |
    The IDE that makes development a more productive and enjoyable experience
  SELF_SERVICE_DISPLAY_NAME: '%NAME%'
  SELF_SERVICE_ICON: '%SOFTWARE_TITLE%.png'
  SELF_SERVICE_INSTALL_BUTTON: Install
  SELF_SERVICE_REINSTALL_BUTTON: Install
  REPLACE_POLICY: 'true'
  PACKAGE_INFO: 'autopkg'
  GROUP_NAME: '%NAME%'
  GROUP_TEMPLATE: "JamfSmartGroupTemplate.xml"
  REPLACE_GROUP: 'true'
  UPDATE_PREDICATE: 'pkg_uploaded == False'
  REPLACE_CATEGORY: 'true'


ParentRecipe: com.github.rtrouton.jamf.citrixworkspace
ParentRecipeTrustInfo:
 
  parent_recipes:
    com.github.rtrouton.download.citrixworkspace:
      git_hash: 930c9f587477b0c48f169ec094e975531926f3a8
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/CitrixWorkspace/CitrixWorkspace.download.recipe
      sha256_hash: 563890f283837e7718af12388cdc7d5b335d77bc32b532c0cc4422b82551d1a6
    com.github.rtrouton.jamf.citrixworkspace:
      git_hash: 637a3be60909a25c2f20a3dca6dec77324ad8844
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/Jamf_Upload/CitrixWorkspace.jamf.recipe
      sha256_hash: 12cd56e8d4259dfd06cf9befa9104e38f6d963e1a051059d967b04af7e591e4f
    com.github.rtrouton.pkg.citrixworkspace:
      git_hash: a8b09b86a03cafd58174380467e26da7980615ea
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/CitrixWorkspace/CitrixWorkspace.pkg.recipe
      sha256_hash: 958beed5dac67ad0b708c192bc19c64e6829db35c09cff2d0f9501318e3ff586


Process:
  # 🟢 1. Ensure Category Exists Before Upload
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: '%CATEGORY%'
      replace_category: '%REPLACE_CATEGORY%'

  # 🟢 2. Ensure Computer Group Exists **Before Policy Upload**
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: '%GROUP_NAME%'
      computergroup_template: '%GROUP_TEMPLATE%'
      replace_group: '%REPLACE_GROUP%'

  # 🟢 3. Upload Package
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  # 🟢 4. Upload Policy **After Group Exists**
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: '%POLICY_TEMPLATE%'
      policy_name: '%POLICY_NAME%'
      icon: '%SELF_SERVICE_ICON%'
      replace_policy: '%REPLACE_POLICY%'

  # 🟢 5. Log Last Recipe Run Result
  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  # 🟢 6. Remove Old Packages (Only If Necessary)
  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%SOFTWARE_TITLE%-'
      versions_to_keep: 2

  # 🟢 7. Final Stop Processing Check
  - Processor: StopProcessingIf
    Arguments:
      predicate: pkg_uploaded == False
