Identifier: com.github.adtejaa.download.Neo4jDesktop
Description: Downloads the latest version of Neo4j Desktop for macOS.
MinimumVersion: '0.2.9'

Input:
  NAME: 'Neo4j-Desktop'
  DOWNLOAD_PAGE_URL: 'https://neo4j.com/download/'
  DOWNLOAD_URL_TEMPLATE: 'https://neo4j.com/artifact.php?name=neo4j-desktop-%version%.dmg'

Process:
  - Processor: 'URLTextSearcher'
    Arguments:
      url: '%DOWNLOAD_PAGE_URL%'
      re_pattern: 'Neo4j Desktop (\d+\.\d+\.\d+)'
      result_output_var_name: 'version'
  - Processor: 'URLDownloader'
    Arguments:
      url: '%DOWNLOAD_URL_TEMPLATE%'
      filename: '%NAME%-%version%.dmg'
  - Processor: 'EndOfCheckPhase'
