Description: Create a package from the Neo4j Desktop download.
Identifier: "com.github.adtejaa.pkg.Neo4jDesktop"
Input:
  NAME: "Neo4j Desktop"
MinimumVersion: "2.3"
ParentRecipe: "com.github.adtejaa.download.Neo4jDesktop"

Process:
  - Processor: "PkgRootCreator"
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%"
      pkgdirs:
        Applications: "0775"

  - Processor: "Copier"
    Arguments:
      destination_path: "%pkgroot%/Applications/%NAME%.app"
      source_path: "%pathname%/%NAME%.app"

  - Processor: "PlistReader"
    Arguments:
      info_path: "%pkgroot%/Applications/%NAME%.app/Contents/Info.plist"
      plist_keys:
        CFBundleShortVersionString: version
        CFBundleIdentifier: bundleid
        CFBundleName: app_name

  - Processor: "PkgCreator"
    Arguments:
      force_pkg_build: true
      pkg_request:
        pkgroot: "%pkgroot%"
        pkgname: "%NAME%-%version%"
        id: "%bundleid%"
        version: "%version%"
        options: purge_ds_store
        chown:
          - path: "Applications"
            user: "root"
            group: "wheel"
