Identifier: com.github.adtejaa.download.Neo4jDesktop
Description: Downloads the specified version of Neo4j Desktop for macOS.
MinimumVersion: '0.2.9'

Input:
  NAME: Neo4j-Desktop
  VERSION: '1.6.1'  # Update this to the latest version as needed
  DOWNLOAD_URL: 'https://neo4j.com/artifact.php?name=neo4j-desktop-%VERSION%.dmg'

Process:
  - Processor: URLDownloader
    Arguments:
      filename: '%NAME%-%VERSION%.dmg'
      url: '%DOWNLOAD_URL%'
  - Processor: EndOfCheckPhase
