Identifier: com.github.adtejaa.download.Neo4jDesktop
Description: Downloads the latest version of Neo4j Desktop for macOS.
MinimumVersion: '2.3.0'

Input:
  NAME: Neo4j-Desktop
  DOWNLOAD_PAGE_URL: 'https://neo4j.com/deployment-center/'

Process:
  - Processor: URLTextSearcher
    Arguments:
      url: '%DOWNLOAD_PAGE_URL%'
      re_pattern: 'data-url="/download/neo4j-desktop/\?edition=desktop&flavour=osx&release=(\d+\.\d+\.\d+)&offline=false"'
      result_output_var_name: version

  - Processor: URLDownloader
    Arguments:
      filename: '%NAME%-%version%.dmg'
      url: 'https://dist.neo4j.org/neo4j-desktop/mac/Neo4j%20Desktop-%version%.dmg'

  - Processor: EndOfCheckPhase
