Identifier: com.github.adtejaa.download.Neo4jDesktop
Description: Download recipe for Neo4j Community Edition.
MinimumVersion: '0.2.9'

Input:
  NAME: Neo4j-CE
  DOWNLOAD_PAGE_URL: 'https://neo4j.com/download/other-releases/'
  DOWNLOAD_URL_TEMPLATE: 'https://neo4j.com/download-thanks/?edition=community&release=%version%&flavour=macos'

Process:
  - Processor: URLTextSearcher
    Arguments:
      url: '%DOWNLOAD_PAGE_URL%'
      re_pattern: 'release=(?P<version>\\d+\\.\\d+\\.\\d+)'
      result_output_var_name: version
  - Processor: URLDownloader
    Arguments:
      url: '%DOWNLOAD_URL_TEMPLATE%'
      filename: '%NAME%-%version%.dmg'
  - Processor: EndOfCheckPhase
