Identifier: com.github.adtejaa.download.Neo4jDesktop
Description: Downloads the latest version of Neo4j Desktop for macOS.
MinimumVersion: '0.2.9'

Input:
  NAME: Neo4j-Desktop
  DOWNLOAD_PAGE_URL: 'https://neo4j.com/download/'
  DOWNLOAD_URL_TEMPLATE: 'https://neo4j.com/download-thanks-desktop/?edition=desktop&flavour=mac&release=%version%&offline=true'

Process:
  - Processor: URLTextSearcher
    Arguments:
      url: '%DOWNLOAD_PAGE_URL%'
      re_pattern: 'release=(\d+\.\d+\.\d+)&offline=true'
      result_output_var_name: version
  - Processor: URLDownloader
    Arguments:
      filename: 'Neo4j-Desktop-%version%.dmg'
      url: '%DOWNLOAD_URL_TEMPLATE%'
  - Processor: EndOfCheckPhase
