Identifier: com.github.adtejaa.jamf.AWSCLI
ParentRecipe: com.github.homebysix.pkg.AWSCLI
Input:
    NAME: AWSCLI
    CATEGORY: Office
    GROUP_NAME: '%NAME%-update-smart'
    GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
    POLICY_CATEGORY: '%CATEGORY%'
    POLICY_NAME: 'Install Latest %NAME%'
    POLICY_TEMPLATE: JamfPolicyTemplate.xml
    POLICY_TRIGGER: Install_MSOffice365
    SELF_SERVICE_DESCRIPTION: WorkPlace.
    SELF_SERVICE_DISPLAY_NAME: 'Install Latest %NAME%'
    SELF_SERVICE_ICON: '%NAME%.png'
    TESTING_GROUP_NAME: Testing
    UPDATE_PREDICATE: 'pkg_uploaded == True'
MinimumVersion: 0.6.1
Process:
    - { Arguments: { category_name: '%CATEGORY%' }, Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader, replace_category: true }
    - { Arguments: { pkg_category: '%CATEGORY%' }, Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader }
    - { Arguments: { predicate: '%UPDATE_PREDICATE%' }, Processor: StopProcessingIf }
    - { Arguments: { computergroup_name: '%GROUP_NAME%', computergroup_template: '%GROUP_TEMPLATE%', replace_group: true }, Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader }
    - { Arguments: { category_name: '%POLICY_CATEGORY%' }, Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader }
    - { Arguments: { icon: '%SELF_SERVICE_ICON%', policy_name: '%POLICY_NAME%', policy_template: '%POLICY_TEMPLATE%', replace_policy: true }, Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader }
