Description: Create a package from the Elgato StreamDeck download.
Identifier: "com.github.adtejaa.pkg.ElgatoStreamDeck"
Input:
  BUNDLE_ID: "com.elgato.streamdeck"
  NAME: "Elgato Stream Deck"
MinimumVersion: "2.3.0"
ParentRecipe: "com.github.dataJAR-recipes.download.Elgato Stream Deck"

Process:
  - Processor: "FlatPkgUnpacker"
    Arguments:
      flat_pkg_path: "%RECIPE_CACHE_DIR%/downloads/ElgatoStreamDeck.pkg"
      destination_path: "%RECIPE_CACHE_DIR%/unpacked"
      purge_destination: true

  - Processor: "FileFinder"
    Arguments:
      find_method: "glob"
      pattern: "%RECIPE_CACHE_DIR%/unpacked/Distribution"
      result_output_var_name: distribution_path

  - Processor: "VersionExtractor"
    Arguments:
      file_path: "%distribution_path%"
      regex_pattern: "(?<=CFBundleShortVersionString=\\\")[^"]+"
      result_output_var_name: version

  - Processor: "PkgRenamer"
    Arguments:
      source_path: "%RECIPE_CACHE_DIR%/downloads/ElgatoStreamDeck.pkg"
      destination_path: "%RECIPE_CACHE_DIR%/downloads/ElgatoStreamDeck-%version%.pkg"

  - Processor: "PkgCreator"
    Arguments:
      force_pkg_build: true
      pkg_request:
        pkgroot: "%RECIPE_CACHE_DIR%/payload"
        pkgname: "ElgatoStreamDeck-%version%"
        id: "%BUNDLE_ID%"
        version: "%version%"
        options: purge_ds_store
        chown:
          - path: "Applications"
            user: "root"
            group: "admin"
