Description: Create a package from the Elgato StreamDeck download.
Identifier: "com.github.adtejaa.pkg.ElgatoStreamDeck"
Input:
  BUNDLE_ID: "com.elgato.streamdeck"
  NAME: "Elgato Stream Deck"
MinimumVersion: "2.3.0"
ParentRecipe: "com.github.dataJAR-recipes.download.Elgato Stream Deck"

Process:
  - Processor: "PkgRootCreator"
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%"
      pkgdirs:
        Applications: "0775"

  - Processor: "Copier"
    Arguments:
      source_path: "%pathname%/Elgato Stream Deck.app"
      destination_path: "%pkgroot%/Applications/Elgato Stream Deck.app"

  - Processor: "PlistReader"
    Arguments:
      info_path: "%pkgroot%/Applications/Elgato Stream Deck.app/Contents/Info.plist"
      plist_keys:
        CFBundleShortVersionString: version

  - Processor: "PkgCreator"
    Arguments:
      force_pkg_build: true
      pkg_request:
        pkgroot: "%pkgroot%"
        pkgname: "%NAME%-%version%"
        id: "%BUNDLE_ID%"
        version: "%version%"
        options: purge_ds_store
        chown:
          - path: "Applications"
            user: "root"
            group: "admin"
