Description: Create a package from the Elgato StreamDeck download.
Identifier: "com.github.adtejaa.pkg.ElgatoStreamDeck"
Input:
  BUNDLE_ID: "com.elgato.streamdeck"
  NAME: "Elgato Stream Deck"
MinimumVersion: "2.3.0"
ParentRecipe: "com.github.dataJAR-recipes.download.Elgato Stream Deck"

Process:
  - Processor: "PkgExtractor"
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/downloads/ElgatoStreamDeck.pkg"
      extract_root: "%RECIPE_CACHE_DIR%/unpacked"
      purge_destination: true

  - Processor: "PkgExtractor"
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/unpacked/Stream_Deck.pkg"
      extract_root: "%RECIPE_CACHE_DIR%/streamdeck"
      purge_destination: true

  - Processor: "PkgPayloadUnpacker"
    Arguments:
      pkg_payload_path: "%RECIPE_CACHE_DIR%/streamdeck/Payload"
      destination_path: "%RECIPE_CACHE_DIR%/payload"
      purge_destination: true

  - Processor: "PlistReader"
    Arguments:
      info_path: "%RECIPE_CACHE_DIR%/payload/Applications/Elgato Stream Deck.app/Contents/Info.plist"
      plist_keys:
        CFBundleShortVersionString: version

  - Processor: "PkgCopier"
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/ElgatoStreamDeck-%version%.pkg"
      source_pkg: "%RECIPE_CACHE_DIR%/downloads/ElgatoStreamDeck.pkg"
