Description: Create a package from the Elgato StreamDeck download.
Identifier: "com.github.adtejaa.pkg.ElgatoStreamDeck"
Input:
  BUNDLE_ID: "com.elgato.streamdeck"
  NAME: "Elgato Stream Deck"
MinimumVersion: "2.3.0"
ParentRecipe: "com.github.dataJAR-recipes.download.Elgato Stream Deck"

Process:
  - Processor: "FlatPkgUnpacker"
    Arguments:
      flat_pkg_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/expand"

  - Processor: "FileFinder"
    Arguments:
      find_method: "glob"
      pattern: "%RECIPE_CACHE_DIR%/expand/Distribution"
      result_output_var_name: "distribution_file"

  - Processor: "URLTextSearcher"
    Arguments:
      url: "file://%RECIPE_CACHE_DIR%/expand/Distribution"
      re_pattern: '<pkg-ref id="com\.elgato\.StreamDeck"[^>]*version="(?P<version>[\d\.]+)"'
      result_output_var_name: "version"

  - Processor: "PkgCopier"
    Arguments:
      source_pkg: "%pathname%"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
