Description: Create a package from the Elgato StreamDeck download.
Identifier: "com.github.adtejaa.pkg.ElgatoStreamDeck"
Input:
  NAME: "ElgatoStreamDeck"
MinimumVersion: "2.3.0"
ParentRecipe: "com.github.dataJAR-recipes.download.Elgato Stream Deck"

Process:
  - Processor: "PkgRootCreator"
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%"
      pkgdirs:
        Applications: "0775"

  - Processor: "PkgExtractor"
    Arguments:
      pkg_path: "%pathname%"
      destination_path: "%pkgroot%/Applications/"

  - Processor: "PlistReader"
    Arguments:
      info_path: "%pkgroot%/Applications/%NAME%.app/Contents/Info.plist"
      plist_keys:
        CFBundleShortVersionString: version
        CFBundleIdentifier: bundleid
        CFBundleName: app_name

  - Processor: "PkgCreator"
    Arguments:
      force_pkg_build: true
      pkg_request:
        pkgroot: "%pkgroot%"
        pkgname: "%NAME%-%version%"
        id: "%bundleid%"
        version: "%version%"
        options: purge_ds_store
        chown:
          - path: "Applications"
            user: "root"
            group: "admin"
