---
Description: "Creates a package from the downloaded MacTeX.pkg."
Identifier: "com.github.adtejaa.pkg.MacTeX"
MinimumVersion: '2.3'
ParentRecipe: "com.github.adtejaa.download.MacTeX"

Input:
  NAME: "MacTeX"

Process:
  - Processor: "EndOfCheckPhase"

  - Processor: "PkgInfoCreator"
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/downloads/MacTeX.pkg"
      output_plist_path: "%RECIPE_CACHE_DIR%/MacTeX.pkginfo"

  - Processor: "PlistReader"
    Arguments:
      info_path: "%RECIPE_CACHE_DIR%/MacTeX.pkginfo"
      plist_keys:
        version: "version"

  - Processor: "PkgCopier"
    Arguments:
      source_pkg: "%RECIPE_CACHE_DIR%/downloads/MacTeX.pkg"
      destination_pkg: "%RECIPE_CACHE_DIR%/MacTeX-%version%.pkg"
