---
Description: "Downloads MacTeX and creates a package."
Identifier: "com.github.adtejaa.pkg.MacTeX"
MinimumVersion: "1.0.0"
ParentRecipe: "com.github.adtejaa.download.MacTeX"

Input:
  NAME: "MacTeX"
  DOWNLOADPAGE_URL: "http://www.tug.org/mactex/mactex-download.html"

Process:
  - Processor: "URLTextSearcher"
    Arguments:
      url: "%DOWNLOADPAGE_URL%"
      re_pattern: "(https[^\"]+MacTeX.pkg)"

  - Processor: "URLDownloader"
    Arguments:
      url: "%match%"

  - Processor: "EndOfCheckPhase"

  - Processor: "PkgExtractor"
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/downloads/MacTeX.pkg"
      extract_root: "%RECIPE_CACHE_DIR%/expanded_MacTeX"

  - Processor: "FileFinder"
    Arguments:
      find_method: "glob"
      pattern: "%RECIPE_CACHE_DIR%/expanded_MacTeX/**/*.app"
      result_output_var_name: "found_app"

  - Processor: "Versioner"
    Arguments:
      input_plist_path: "%found_app%/Contents/Info.plist"
      plist_keys:
        CFBundleShortVersionString: "version"

  - Processor: "AppPkgCreator"
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/MacTeX-%version%.pkg"
      version: "%version%"
      id: "org.tug.mactex"
      install_location: "/Applications"
      chown:
        - path: "/Applications"
          user: "root"
          group: "admin"
