---
Description: "Downloads MacTeX and creates a package."
Identifier: "com.github.adtejaa.pkg.MacTeX"
MinimumVersion: "1.0.0"
ParentRecipe: "com.github.adtejaa.download.MacTeX"

Input:
  NAME: "MacTeX"
  DOWNLOADPAGE_URL: "http://www.tug.org/mactex/mactex-download.html"

Process:
  - Processor: "URLTextSearcher"
    Arguments:
      url: "%DOWNLOADPAGE_URL%"
      re_pattern: "(https[^\"]+MacTeX.pkg)"
      result_output_var_name: "download_url"

  - Processor: "URLDownloader"
    Arguments:
      url: "%download_url%"
      filename: "MacTeX.pkg"
      download_dir: "%RECIPE_CACHE_DIR%/downloads"

  - Processor: "EndOfCheckPhase"

  - Processor: "InstallerPackageVersioner"
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/downloads/MacTeX.pkg"
      result_output_var_name: "version"

  - Processor: "AppPkgCreator"
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/MacTeX-%version%.pkg"
      version: "%version%"
      id: "org.tug.mactex"
      install_location: "/Applications"
      chown:
        - path: "/Applications"
          user: "root"
          group: "admin"
