---
Description: "Downloads MacTeX and creates a package."
Identifier: "com.github.adtejaa.pkg.MacTeX"
MinimumVersion: "1.0.0"
ParentRecipe: "com.github.adtejaa.download.MacTeX"

Input:
  NAME: "MacTeX"
  DOWNLOADPAGE_URL: "http://www.tug.org/mactex/mactex-download.html"

Process:
  - Processor: "URLTextSearcher"
    Arguments:
      url: "%DOWNLOADPAGE_URL%"
      re_pattern: "(https[^\"]+MacTeX.pkg)"

  - Processor: "URLDownloader"
    Arguments:
      url: "%match%"

  - Processor: "EndOfCheckPhase"

  - Processor: "PkgExtractor"
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/downloads/MacTeX.pkg"
      destination_path: "%RECIPE_CACHE_DIR%/expanded_MacTeX"

  - Processor: "Versioner"
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/expanded_MacTeX/Payload/Library/Receipts/Info.plist"
      plist_keys:
        CFBundleShortVersionString: "version"

  - Processor: "AppPkgCreator"
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/MacTeX-%version%.pkg"
      version: "%version%"
      id: "org.tug.mactex"
      install_location: "/Applications"
      chown:
        - path: "/Applications"
          user: "root"
          group: "wheel"

