---
Description: "Downloads and processes the MacTeX installer package."
Identifier: "com.github.adtejaa.pkg.MacTeX"
MinimumVersion: '2.3'
ParentRecipe: "com.github.adtejaa.download.MacTeX"

Input:
  NAME: "MacTeX"

Process:
  - Processor: "FlatPkgUnpacker"
    Arguments:
      flat_pkg_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/expand"

 - Processor: "URLTextSearcher"
   Arguments:
     url: "file://%distribution_file%"
     re_pattern: 'version="(?P<version>\d+\.\d+)"'
     result_output_var_name: "version" 

  - Processor: "URLTextSearcher"
    Arguments:
      url: "file:////%RECIPE_CACHE_DIR%/expand/Distribution"
      re_pattern: 'version="(?P<version>\d+\.\d+)"'

  - Processor: "PkgCopier"
    Arguments:
      source_pkg: "%pathname%"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
