---
Description: "Creates a package from the downloaded MacTeX.pkg."
Identifier: "com.github.adtejaa.pkg.MacTeX"
MinimumVersion: '2.3'
ParentRecipe: "com.github.adtejaa.download.MacTeX"

Input:
  NAME: "MacTeX"

Process:
  - Processor: "EndOfCheckPhase"

  - Processor: "FlatPkgUnpacker"
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/downloads/MacTeX.pkg"
      destination_path: "%RECIPE_CACHE_DIR%/expanded_MacTeX"

  - Processor: "FileFinder"
    Arguments:
      find_method: "glob"
      pattern: "%RECIPE_CACHE_DIR%/expanded_MacTeX/**/*.app"
      result_output_var_name: "found_app"

  - Processor: "Versioner"
    Arguments:
      input_plist_path: "%found_app%/Contents/Info.plist"
      plist_keys:
        CFBundleShortVersionString: "version"

  - Processor: "AppPkgCreator"
    Arguments:
      app_path: "%found_app%"
      version: "%version%"
      pkg_name: "%NAME%-%version%.pkg"
      id: "org.tug.mactex"
      install_location: "/Applications"
      chown:
        - path: "/Applications"
          user: "root"
          group: "admin"
