---
Description: "Creates a package from the downloaded MacTeX.pkg."
Identifier: "com.github.adtejaa.pkg.MacTeX"
MinimumVersion: "2.3"
ParentRecipe: "com.github.adtejaa.download.MacTeX"

Input:
  NAME: "MacTeX"

Process:
  - Processor: "EndOfCheckPhase"

  - Processor: "PkgExtractor"
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/downloads/MacTeX.pkg"
      extract_root: "%RECIPE_CACHE_DIR%/expanded_MacTeX"

  - Processor: "FileFinder"
    Arguments:
      find_method: "glob"
      pattern: "%RECIPE_CACHE_DIR%/expanded_MacTeX/PackageInfo"
      result_output_var_name: "found_pkginfo"

  - Processor: "PlistReader"
    Arguments:
      info_path: "%found_pkginfo%"
      plist_keys:
        pkg-version: "version"

  - Processor: "PkgCreator"
    Arguments:
      pkg_request:
        pkg_path: "%RECIPE_CACHE_DIR%/MacTeX-%version%.pkg"
        id: "org.tug.mactex"
        version: "%version%"
        install_location: "/Applications"
        chown:
          - path: "/Applications"
            user: "root"
            group: "admin"
