
---
Description: "Creates a package from the downloaded MacTeX.pkg."
Identifier: "com.github.adtejaa.pkg.MacTeX"
MinimumVersion: '2.3'
ParentRecipe: "com.github.adtejaa.download.MacTeX"

Input:
  NAME: "MacTeX"

Process:
  - Processor: "FlatPkgUnpacker"
    Arguments:
      flat_pkg_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/expand"

  - Processor: "FileFinder"
    Arguments:
      find_method: "glob"
      pattern: "%RECIPE_CACHE_DIR%/expand/Distribution"
      result_output_var_name: "distribution_file"

  - Processor: "URLTextSearcher"
    Arguments:
      url: "file://%distribution_file%"
      re_pattern: 'version="(?P<version>\d+\.\d+\.\d+)"'

  - Processor: "PkgCopier"
    Arguments:
      source_pkg: "%pathname%"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
