
Below is the final recipe
---
Description: Downloads the latest version IntelliJ IDEA, packages it, then uploads it to Jamf.
Identifier: com.github.adtejaa.jamf.rider
ParentRecipe: com.github.adtejaa.pkg.rider
MinimumVersion: '2.3'

Input:
  NAME: 'Rider'
  SOFTWARE_TITLE: %NAME%
  CATEGORY: Apps
  POLICY_CATEGORY: Apps
  POLICY_NAME: '%NAME%'
  POLICY_RUN_COMMAND: ' '
  POLICY_CUSTOM_TRIGGER: 'install-%NAME%'
  POLICY_RUN_RECON: 'false'
  POLICY_SCOPE_ALL_COMPUTERS: 'true'
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  REMOVE_OLD_PACKAGES: 'true'
  SELF_SERVICE_AVAILABLE: 'true'
  SELF_SERVICE_CATEGORY: '%CATEGORY%'
  SELF_SERVICE_DESCRIPTION: |
    The IDE that makes development a more productive and enjoyable experience
  SELF_SERVICE_DISPLAY_NAME: '%NAME%'
  SELF_SERVICE_ICON: '%SOFTWARE_TITLE%.png'
  SELF_SERVICE_INSTALL_BUTTON: Install
  SELF_SERVICE_REINSTALL_BUTTON: Install
  REPLACE_POLICY: 'true'
  PACKAGE_INFO: 'autopkg'
  GROUP_NAME: '%NAME%'
  GROUP_TEMPLATE: "JamfSmartGroupTemplate.xml"
  REPLACE_GROUP: 'true'
  UPDATE_PREDICATE: 'pkg_uploaded == False'
  REPLACE_CATEGORY: 'true'



Need to follow these steps

Process:
  # 🟢 1. Ensure Category Exists Before Upload
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: '%CATEGORY%'
      replace_category: '%REPLACE_CATEGORY%'

  # 🟢 2. Ensure Computer Group Exists **Before Policy Upload**
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: '%GROUP_NAME%'
      computergroup_template: '%GROUP_TEMPLATE%'
      replace_group: '%REPLACE_GROUP%'

  # 🟢 3. Upload Package
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  # 🟢 4. Upload Policy **After Group Exists**
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: '%POLICY_TEMPLATE%'
      policy_name: '%POLICY_NAME%'
      icon: '%SELF_SERVICE_ICON%'
      replace_policy: '%REPLACE_POLICY%'

  # 🟢 5. Log Last Recipe Run Result
  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  # 🟢 6. Remove Old Packages (Only If Necessary)
  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%SOFTWARE_TITLE%-'
      versions_to_keep: 2

  # 🟢 7. Final Stop Processing Check
  - Processor: StopProcessingIf
    Arguments:
      predicate: pkg_uploaded == False
