Description: Downloads latest Tableau Prep disk image.
Identifier: com.github.adtejaa.download.tableau-prep
MinimumVersion: "2.3.0"

Input:
  DOWNLOAD_URL: "https://www.tableau.com/downloads/prep/mac"
  NAME: "TableauPrep"

Process:
  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%.dmg"
      url: "%DOWNLOAD_URL%"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - "Developer ID Installer: Tableau Software, LLC (QJ4XPRK37C)"
        - "Developer ID Certification Authority"
        - "Apple Root CA"
      input_path: "%pathname%/Tableau Prep Builder.pkg"
